Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: སྡིག་པའི་ལས་ཀྱང་ཅུང་ཟད་ཀྱང་མི་བྱེད་ལ། བསོད་ནམས་ཀྱི་ལམ་ཡང་ཡང་དག་པར་བླངས་ཏེ།
en: and who carry out not even the smallest nonvirtuous action but embrace the meritorious path,

source: འདུག་ན་དེ་ལ་དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ཀྱིས་དགེ་བའི་སེམས་ཀྱིས་སླར་སྙིང་བརྩེ་བར་བྱེད་དོ། །
en: such that the ascetics and brahmins, with minds of virtue, treat them with wholehearted love in return.

source: འཛིན་བྱེད་ཀྱི་བུ་དེ་ལྟར་དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ཀྱིས་དགེ་བའི་སེམས་ཀྱིས་སླར་སྙིང་བརྩེ་བར་བྱས་པའི་སྐྱེས་བུ་གང་ཟག་དེའི་ནི། དགེ་བའི་ཆོས་རྣམས་འཕེལ་བ་འབའ་ཞིག་ཏུ་འགྱུར་བར་རེ་བར་བྱས་ཏེ་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ། །
en: So it is, Son of Grasping, that the virtues of people whom ascetics and brahmins, with minds of virtue, treat with wholehearted love in return, are expected to increase, and never wane.”

source: དེ་སྐད་ཅེས་སྨྲས་ནས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ངུས་ཏེ་མཆི་མ་བླགས་སོ། །
en: After he had spoken thus, tears fell from the eyes of the brahmin Son of Grasping.

source: དེ་ནས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུས་གོས་ཀྱི་མཐའ་མས་མཆི་མ་ཕྱིས་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the brahmin Son of Grasping, wiping away his tears with the hem of his garment, lamented to Venerable Śāriputra,

source: ཀྱེ་ཤཱ་རིའི་བུ་འདི་ནི་བདག་གི་མཆིས་བྲང་བག་སར་བླངས་ནས་རིང་པོ་མ་ལགས་པ་ཞིག་མཆིས་ཏེ།
en: “Alas, Śāriputra, it was not in times past that I carefully selected my new bride.

source: དེའི་སླད་དུ་བདག་གིས་བག་མ་མཆིས་པར་སྡིག་པ་ཁ་ན་མ་ཐོ་བ་མང་པོ་བགྱིས་ཀྱིས།
en: Yet for her sake, heedless, I have already committed so many sinful misdeeds.

source: བཙུན་པ་ཤཱ་རིའི་བུ་བག་སར་འདི་བདག་གིས་གཏན་དུ་སླར་བཏང་ལ། དེང་སླན་ཆད་བཙུན་པ་ཤཱ་རིའི་བུ་ལས་ཚངས་པར་སྤྱོད་པ་ལྔ་པའི་བསླབ་པའི་གཞི་རྣམས་ཡང་དག་པར་ནོད་པར་འཚལ་ལོ། །
en: Lord, henceforth I will forsake my new bride and today receive from you, Lord Śāriputra, the fundamental precepts of pure conduct.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ཚངས་པར་སྤྱོད་པ་ལྔ་པའི་བསླབ་པའི་གཞི་རྣམས་ལ་གནས་པར་བྱས་ནས་སྟན་ལས་ལངས་ཏེ་སོང་ངོ་། །
en: Thereupon Venerable Śāriputra led the brahmin Son of Grasping to abide in the fundamental precepts of the holy life, then rose from his seat and departed.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རིའི་ནགས་ཁྲོད་ག་ལ་བ་དེར་སོང་བ་ལས། དགེ་སློང་གཞན་ཞིག་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པ་ནས།
en: Venerable Śāriputra traveled to the mountain forests in the south,

source: ལྷོ་ཕྱོགས་ཀྱི་རིའི་ནགས་ཁྲོད་ག་ལ་བ་དེར་སོང་ནས་དགེ་སློང་དེས་ཐག་རིང་པོ་ཞིག་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་མཐོང་ངོ་། །
en: where there lived another monk who had traveled from the Kalandakanivāsa, in Bamboo Grove, to those mountain forests in the south.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Upon his arrival he touched his head to Venerable Śāriputra’s feet and took a seat at one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་དགེ་སློང་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Once the monk had taken a seat at one side, Venerable Śāriputra asked him,

source: དགེ་སློང་ཁྱོད་ད་གདོད་ག་ལས་འོངས།
en: “Monk, whence have you just come?”

source: དགེ་སློང་དེས་སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་བདག་ད་གཟོད་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པ་ནས་མཆིས་སོ། །
en: “Venerable Śāriputra,” the monk replied, “I have just come from the Kalandakanivāsa, in Bamboo Grove.”

source: ཤཱ་རིའི་བུས་སྨྲས་པ། བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ཤེས་སམ།
en: “Do you know the brahmin Son of Grasping?” asked Śāriputra.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བདག་འཚལ་ཏེ།
en: “Yes, Venerable Śāriputra, I do,” he replied.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་སྔོན་གྱི་ཁྱིམ་ན་གནས་པའི་ཚེའི་གྲོགས་པོ་ལགས་སོ། །
en: “He was a friend, Venerable Śāriputra, while you yet lived at home.”

source: ཤཱ་རིའི་བུས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་གནོད་པ་ཆུང་ངམ།
en: Śāriputra then inquired, “Has Venerable Son of Grasping met with any harm?

source: ཉམ་ང་བ་ཉུང་ངམ།
en: Does he despair?

source: བདེ་བ་དང་ལྡན་ནམ།
en: Is he happy?

source: ནད་མེད་དམ།
en: Is he free of illness, healthy, and strong?

source: སྟོབས་དང་ལྡན་པར་རྒྱལ་པོའི་ཁབ་ན་གནས་སམ།
en: Is he living in Rājagṛha?

source: སྟོན་པ་མཐོང་བར་དགའ་འམ།
en: Does he like to see his teacher?

source: ཆོས་མཉན་པར་དགའ་འམ།
en: Does he enjoy listening to the Dharma?”

source: དགེ་སློང་དེས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ནི་སྟོན་པ་བལྟ་བར་ཡང་དགའ། ཆོས་མཉན་པར་ཡང་དགའ་མོད་ཀྱི།
en: “Venerable Śāriputra,” answered the monk, “the brahmin Son of Grasping likes to see his teacher and enjoys listening to the Dharma.

source: གནོད་པ་དང་ལྡན་ཞིང་སྡུག་བསྔལ་དང་ལྡན་ཏེ་
en: However, he met with some harm, and now he suffers.

source: ནད་པར་གྱུར་པས་གལ་ཏེ་ན་ནད་དེ་ཁོ་ནས་འཆི་བར་འགྱུར་ཡང་སྲིད་དོ། །
en: He has fallen ill, and from this illness he may die.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཆོས་གོས་སྣམ་སྦྱར་བགོས་ཏེ། བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུའི་ཁྱིམ་ག་ལ་བ་དེར་སོང་བ་ལས་
en: Venerable Śāriputra donned his Dharma robes and went to the brahmin Son of Grasping’s house.

source: མཐོང་ནས་ཀྱང་ཁྲི་ལས་ལྡང་དུ་སྩོལ་ལོ། །
en: and upon seeing him, tried to rise from his seat.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ཁྲི་ལས་ལྡང་བར་སྩོལ་བ་མཐོང་ནས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ལ་སྨྲས་པ།
en: When Venerable Śāriputra saw the brahmin Son of Grasping trying to rise from his seat, he said to him,

source: འཛིན་བྱེད་ཀྱི་བུ་ང་འདུག་པའི་སྟན་གཞན་དག་ཀྱང་ཡོད་ཀྱིས།
en: “Son of Grasping, there is another seat for me to sit on.

source: ཁྱོད་ཁྲི་ལས་མ་ལྡང་ཅིག་ཅེས་བྱས་ནས་
en: Please, don’t get up.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྟན་བཤམས་པ་ལ་འདུག་གོ། །
en: Venerable Śāriputra sat on the seat prepared for him

source: འདུག་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: and asked the brahmin Son of Grasping,

source: འཛིན་བྱེད་ཀྱི་བུ་ཅི་ཁྱོད་བཟོད་པ་དང་ལྡན་ནམ།
en: “Son of Grasping, tell me, are you able to endure?

source: འཚོ་འམ།
en: Are you recovering?

source: ཅི་ཁྱོད་ཀྱི་སྡུག་བསྔལ་དྲག་པ་དང་། མི་བཟད་པ་དང་། ཚ་བ་དང་། ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་དྲག་པོ་རྣམས་མེད་པར་གྱུར་ཏམ།
en: Tell me, has your dreadful suffering and extreme, excruciating, unbearable agony gone away

source: ཕྱིར་ཐུ་བར་མ་གྱུར་ཏམ།
en: and not gotten worse?

source: མེད་པར་གྱུར་པར་མངོན་ནམ།
en: Has it abated?

source: ཕྱིས་ཐུ་བར་གྱུར་པར་མི་མངོན་གྲང་།
en: Has it not calmed down?”

source: འཛིན་བྱེད་ཀྱི་བུས་སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་བདག་ནི་བཟོད་པ་དང་ལྡན་པ་མ་ཡིན།
en: “Lord Śāriputra,” said Son of Grasping, “I cannot endure this.

source: འཚོ་བ་དང་ལྡན་པ་མ་ཡིན་ཏེ།
en: I am not recovering.

source: བདག་གི་ལུས་ལ་སྡུག་བསྔལ་དྲག་པ་དང་། མི་བཟད་པ་དང་། ཚ་བ་དང་། ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་ཚབས་ཆེན་པོ་དག་གིས་ཐེབས་ཏེ།
en: My body is wracked with dreadful suffering and extreme, excruciating, unbearable agony.

source: བདག་གི་ཚོར་བ་དེ་དག་ཕྱིས་ཐུ་ཞིང་ཕྱིས་ན་བར་མངོན་གྱི་མེད་པར་མ་གྱུར་ཏོ། །
en: The pain has worsened, and it seems that the illness will not abate.

source: བཙུན་པ་ཤཱ་རིའི་བུ་དཔེར་ན་མི་སྟོབས་ཆེ་རབ་ཅིག་གིས་མི་ཉམ་ཆུང་རབ་ཅིག་གི་མགོ་བོ་འབྲེང་བ་བཟང་པོ་རིང་པོས་དམ་དུ་བཅིངས་ན་
en: “Lord Śāriputra, take a very weak person, around whose head a very strong person has tied thick leather rope very tightly.

source: དེའི་མགོ་བོ་མི་བཟད་པར་ན་བར་འགྱུར་བ་དེ་བཞིན་དུ་བཙུན་པ་ཤཱ་རིའི་བུ་བདག་གི་མགོ་བོ་ལ་ཚོར་བ་མི་བཟད་ཅིང་འདུག་སྟེ
en: The pain in that person’s head would be unbearable. Lord Śāriputra, in my head there is an unbearable pain like this.

source: བདག་གི་ཚོར་བ་དེ་དག་ཕྱིས་ཐུ་ཞིང་ཕྱིས་ལ་ན་བར་མངོན་གྱི་མེད་པར་མ་གྱུར་ཏོ། །
en: The pain has worsened, and it seems that the illness will not abate.

source: བཙུན་པ་ཤཱ་རིའི་བུ་དཔེར་ན་བ་ལང་གསོད་པའམ། བ་ལང་གསོད་པའི་སློབ་མས་བ་ལང་བཤའ་བའི་གྲི་རྣོན་པོས་བ་ལང་གི་ལྟོ་དྲལ་ན་དེའི་ལྟོ་བའི་ཚོར་བ་མི་བཟད་པར་འགྱུར་བ་དེ་བཞིན་དུ་བཙུན་པ་ཤཱ་རིའི་བུ་བདག་གི་ལྟོ་བའི་ནད་མི་བཟད་པར་འདུག་སྟེ་
en: “Lord Śāriputra, take for instance the belly of a cow gutted by a butcher’s apprentice with a slaughtering knife. As its stomach is ripped open, the pain would be unbearable. Lord Śāriputra, my stomach is rent with an unbearable pain like this.

source: བཙུན་པ་ཤཱ་རིའི་བུ་དཔེར་ན་མི་སྟོབས་ཆེ་རབ་གཉིས་ཀྱིས་མི་སྟོབས་ཆུང་རབ་ཅིག་དཔུང་པ་གཡས་གཡོན་ནས་བཟུང་སྟེ། མེ་མདག་གི་ནང་དུ་སྲེག་པར་བྱེད་ན་
en: “Lord Śāriputra, take for instance a very weak person whose shoulders are gripped right and left by two very strong persons who push him down into burning embers.

source: དེའི་ལུས་མི་བཟད་པར་ཚ་བར་འགྱུར་བ་དེ་བཞིན་དུ་བཙུན་པ་ཤཱ་རིའི་བུ་བདག་གི་ལུས་ཤིན་ཏུ་ཚ་ཞིང་འདུག་སྟེ།
en: The pain in that person’s body would be searing and unbearable. Lord Śāriputra, my body is filled with pain that is searing and unbearable like this.

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེས་ན་བདག་ནི་བཟོད་པ་དང་ལྡན་པ་མ་ཡིན།
en: “That is why, Lord Śāriputra, I cannot endure it.

source: ཤཱ་རིའི་བུས་སྨྲས་པ། འཛིན་བྱེད་ཀྱི་བུ་འོ་ན་ཁྱོད་ཉིད་ལ་དྲི་བར་བྱས་ཁྱོད་ཀྱིས་ཇི་ལྟར་བཟོད་པ་དེ་བཞིན་དུ་ལན་ཐོབ་ཤིག །
en: “Son of Grasping,” Śāriputra said, “I have some questions for you. Just answer as best you can.

source: སེམས་ཅན་དམྱལ་བ་དང་དུད་འགྲོ་གང་བདམ།
en: Which would you choose, rebirth as a hell being or as an animal?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་སེམས་ཅན་དམྱལ་བ་པས་ནི་དུད་འགྲོ་བདམ་མོ། །
en: “Lord Śāriputra, I would choose rebirth as an animal over rebirth as a hell being.”

source: དུད་འགྲོ་དང་ཡི་དགས་གང་བདམ།
en: “Which would you choose, rebirth as an animal or as an anguished spirit?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་དུད་འགྲོ་བས་ནི་ཡི་དགས་བདམ་མོ། །
en: “Lord Śāriputra, I would choose rebirth as an anguished spirit over an animal birth.”

source: ཡི་དགས་དང་མི་གང་བདམ།
en: “Which would you choose, rebirth as an anguished spirit or as a human?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཡི་དགས་པས་ནི་མི་བདམ་མོ། །
en: “Lord Śāriputra, I would choose rebirth as a human over rebirth as an anguished spirit.”

source: མི་དང་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་གང་བདམ།
en: “Which would you choose, rebirth as a human or a god in the Abodes of the Four Great Kings?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་མི་བས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་བདམ་མོ། །
en: “Lord Śāriputra, I would choose rebirth as a god in the Abodes of the Four Great Kings over a human birth.”

source: རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དང་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་གང་བདམ།
en: “Which would you choose, rebirth as a god in the Abodes of the Four Great Kings or as a god in the Heaven of the Thirty-Three?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་བས་ནི་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་བདམ་མོ། །
en: “Lord Śāriputra, I would choose rebirth as a god in the Heaven of the Thirty-Three over being a god in the Abodes of the Four Great Kings.”

source: སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་དང་འཐབ་བྲལ་གྱི་ལྷ་གང་བདམ།
en: “Which would you choose, rebirth as a god in the Heaven of the Thirty-Three or as a god in the Strifeless Heaven?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་བས་ནི་འཐབ་བྲལ་གྱི་ལྷ་བདམ་མོ། །
en: “Lord Śāriputra, I would choose rebirth as a god in the Strifeless Heaven over being a god in the Heaven of the Thirty-Three.”

source: འཐབ་བྲལ་གྱི་ལྷ་དང་དགའ་ལྡན་པའི་ལྷ་གང་བདམ།
en: “Which would you choose, rebirth as a god in the Strifeless Heaven or as a god in Tuṣita?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་འཐབ་བྲལ་བའི་ལྷ་བས་ནི་དགའ་ལྡན་པའི་ལྷ་བདམ་མོ། །
en: “Lord Śāriputra, I would choose rebirth as a god in Tuṣita over rebirth as a god in the Strifeless Heaven.”

source: དགའ་ལྡན་པའི་ལྷ་དང་འཕྲུལ་དགའི་ལྷ་གང་བདམ།
en: “Which would you choose, rebirth as a god in Tuṣita or as a god in the Delighting in Creation Heaven?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་དགའ་ལྡན་པའི་ལྷ་བས་ནི་འཕྲུལ་དགའ་བའི་ལྷ་བདམ་མོ། །
en: “Lord Śāriputra, I would choose rebirth as a god in the Delighting in Creation Heaven over rebirth as a god in the Tuṣita Heaven.”

source: འཕྲུལ་དགའ་བའི་ལྷ་དང་གཞན་འཕྲུལ་དབང་བྱེད་པའི་ལྷ་གང་བདམ།
en: “Which would you choose, rebirth as a god in the Delighting in Creation Heaven or as a god in the Heaven of the Masters of Others’ Creations?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་འཕྲུལ་དགའི་ལྷ་བས་ནི་གཞན་འཕྲུལ་དབང་བྱེད་པའི་ལྷ་བདམ་མོ། །
en: “Lord Śāriputra, I would choose rebirth as a god in the Heaven of the Masters of Others’ Creations over rebirth as a god in the Delighting in Creation Heaven.”

source: གཞན་འཕྲུལ་དབང་བྱེད་པའི་ལྷ་དང་ཚངས་པའི་འཇིག་རྟེན་ལ་གང་བདམ།
en: “Which would you choose, rebirth as a god in the Heaven of the Masters of Others’ Creations or as a god in Brahmāloka?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་འཕྲུལ་དབང་བྱེད་པའི་ལྷ་བས་ནི་ཚངས་པའི་འཇིག་རྟེན་བདམ་མོ། །
en: “Lord Śāriputra, I would choose rebirth as a god in Brahmāloka over rebirth as a god in the Heaven of the Masters of Others’ Creations.”

source: འཛིན་བྱེད་ཀྱི་བུ་ཚངས་པའི་འཇིག་རྟེན་བདམ་ཞེས་ཟེར་རམ།
en: “Son of Grasping, did you say that you would choose Brahmāloka?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཚངས་པའི་འཇིག་རྟེན་བདམ་ཞེས་མཆིའོ། །
en: “Yes, Lord Śāriputra, I did say that I would choose Brahmāloka.”

source: དེ་ནས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ཡུད་ཙམ་ཞིག་ཅང་མི་ཟེར་བར་འདུག་ནས་
en: For a moment Son of Grasping did not say anything.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then he asked Śāriputra,

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེ་ལྟར་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་བས་ཚངས་པའི་འཇིག་རྟེན་བདམ་པར་གྱུར་ན་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར་བའི་ལམ་མཆིས་སམ།
en: “Lord Śāriputra, now that I’ve chosen Brahmāloka over god in the Heaven of the Masters of Others’ Creations, is there a path that leads to rebirth in Brahmāloka?”

source: འཛིན་བྱེད་ཀྱི་བུ་ལམ་ཡང་ཡོད། སྲང་ཡང་ཡོད་དེ།
en: “Yes, Son of Grasping, there is a way. There is a path.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དད་པ་དང་ལྡན་པས་དེ་བསྒོམས་ན་
en: Faithful sons and daughters of good lineage who in greater part remain in meditation upon it,

source: འདོད་པའི་འདུན་པ་སྤངས་ནས་དེ་ལ་ཤས་ཆེར་གནས་པས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་འགྱུར་བ་དེ་
en: casting away all yearning for their desires, will be born into worlds equal in fortune to Brahmāloka.

source: ངས་བཤད་ན་དེ་ཁྱོད་ཀྱིས་ཤེས་པར་ནུས་སམ།
en: If I explain it to you, will you be able to understand?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་ཤོད་ཅིག་དང་བདག་གིས་མཉན་ཏོ། །
en: “Tell me, Lord Śāriputra, and I shall listen.”

source: འཛིན་བྱེད་ཀྱི་བུ་འདི་ན་འཕགས་པ་ཉན་ཐོས་ནི་འདོད་པའི་ཡོན་ཏན་ལྔ་སེམས་ཀྱི་ཉེ་བའི་ཉོན་མོངས་པ་སྐྱེད་པ། ཤེས་རབ་ཀྱི་གནས་ངན་ལེན་སྐྱེད་པ། ཕོངས་པར་འགྱུར་བའི་ཕྱོགས་མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་བ་སྤངས་ནས་
en: “Son of Grasping, noble listeners cast aside generating the subsidiary afflictive emotions toward the five sense pleasures, cast aside the tendency that perpetuates ignoble states of existence, and cast aside the tendency for conflict that keeps them from passing beyond suffering.

source: བྱམས་པ་དང་ལྡན་པའི་སེམས་འཁོན་མེད་པ། དགྲ་ཟླ་མེད་པ། གནོད་པ་མེད་པ། ཡངས་པ་ཆེན་པོར་གྱུར་པ།
en: Their minds are suffused with love, and they become magnanimous—without hostility, envy, or ill will.

source: གཉིས་སུ་མེད་པ། ཚད་མེད་པ། ཤིན་ཏུ་བསྒོམས་པས་ཕྱོགས་གཅིག་ཏུ་མོས་ཏེ་ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: “By meditating deeply on the nondual and the immeasurable, they devote themselves to the first of the cardinal directions, until they have pervaded it to its very end, and abide therein,

source: དེ་བཞིན་དུ་ཕྱོགས་གཉིས་པ་དང་། དེ་བཞིན་དུ་གསུམ་པ་དང་། དེ་བཞིན་དུ་བཞི་པ་དང་། བླ་དང་། འོག་དང་། ཐད་ཀར་རྣམ་པ་ཐམས་ཅད་དུ་འཇིག་རྟེན་འདི་དག་ཐམས་ཅད་བྱམས་པ་དང་ལྡན་པའི་སེམས་འཁོན་མེད་པ། དགྲ་ཟླ་མེད་པ། གནོད་པ་མེད་པ། ཡངས་པ། ཆེན་པོར་གྱུར་པ།
en: In the very same way, whether in the second, third, or fourth of the cardinal directions, above, below, or straight ahead, they become magnanimous—without hostility, envy, or ill will.

source: གཉིས་སུ་མེད་པ། ཚད་མེད་པ་ཤིན་ཏུ་བསྒོམས་པས་མོས་ཏེ་ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: They meditate deeply on the nondual and the immeasurable and devote themselves to a single cardinal direction, pervading it to its very end, and abide therein.”

source: དེ་བཞིན་དུ་སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཆེན་པོར་གྱུར་པའི་བར་དུ་རྒྱས་པར་བརྗོད་པར་བྱས་ཏེ།
en: Śāriputra went on to also explain this in detail with regard to compassion, joy, and great equanimity.

source: འཛིན་བྱེད་ཀྱི་བུ་འདི་ནི་ལམ་ཡིན། འདི་ནི་སྲང་ཡིན་ཏེ།
en: “Son of Grasping, this is the way, this is the path.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དད་པ་དང་ལྡན་པས་དེ་བསྒོམས་ན་འདོད་པའི་འདུན་པ་སྤངས་ནས་དེ་ལ་ཤས་ཆེར་གནས་པས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་འགྱུར་རོ་ཞེས་བྱས་སོ། །
en: Faithful sons and daughters of a good lineage who in greater part remain in meditation on it and cast away all yearning for their desires will be born into worlds equal in fortune to Brahmāloka.”

source: དེ་ལྟར་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ཚད་མེད་པ་བཞི་ལ་གནས་པར་བྱས་ནས་སོང་ངོ་། །
en: Having thus led Son of Grasping to abide in the four immeasurables, Venerable Śāriputra departed.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སོང་ནས་རིང་པོ་མ་ལོན་པར་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: As soon as Venerable Śāriputra had gone, the Blessed One thought,

source: དགེ་སློང་ཤཱ་རིའི་བུས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ལ་དེའི་སྟེང་དུ་བདེན་པ་རྣམས་མ་བཤད་པ་ནི་ཚར་ཕྱིན་པ་མ་ཡིན་ནོ་
en: “The truths as the monk Śāriputra told them to Son of Grasping are not complete.”

source: སྙམ་དུ་དགོངས་ནས་འོད་མའི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ཏེབྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་ཁྱིམ་དུ་བཞུགས་པར་གྱུར་ཏོ། །
en: Having thought this, he disappeared from Bamboo Grove and appeared sitting in the house of the brahmin Son of Grasping.

source: དེ་ནས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུས་བཅོམ་ལྡན་འདས་གདན་ལ་བཞུགས་པར་མཐོང་ངོ་། །
en: The brahmin Son of Grasping saw the Blessed One sitting there upon a cushion,

source: དགའ་བར་གྱུར་ནས་ཀྱང་ཁྲི་ལས་ལངས་ཏེ་འདུག་གོ། །
en: In his joy he rose from his own seat and stood.

source: དེ་ནས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: and the brahmin Son of Grasping manifested the resultant state of non-return right where he sat.

source: དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་གནས་པར་མཛད་ནས་འཛིན་བྱེད་ཀྱི་བུའི་ཁྱིམ་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: After the Blessed One had placed the brahmin Son of Grasping in the resultant state of non-return, he disappeared from the home of Son of Grasping,

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འོད་མའི་ཚལ་དུ་མ་ཕྱིན་པར་བཅོམ་ལྡན་འདས་ཆེས་སྔར་འོད་མའི་ཚལ་དུ་གཤེགས་ནས་ཉིད་ཀྱི་གདན་ལ་བཞུགས་སོ། །
en: and before Śāriputra was able to reach Bamboo Grove, the Blessed One arrived and took his seat at Bamboo Grove.

source: དེ་ནས་བཅོམ་ལྡན་འདས་གཤེགས་ནས་རིང་པོ་མ་ལོན་པར་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ཤི་སྟེ་དུས་ལས་འདས་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: Soon after the Blessed One had departed, the brahmin Son of Grasping died, transmigrated, and took birth in Brahmāloka.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: Venerable Śāriputra went to see the Blessed One.

source: ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས།
en: When he arrived, he touched his head to the Blessed One’s feet and took a seat at one side.

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One asked Venerable Śāriputra,

source: ཤཱ་རིའི་བུ་ཁྱོད་ད་གཟོད་ག་ལས་འོངས།
en: “Śāriputra, whence have you just come?”

source: ཤཱ་རིའི་བུས་གསོལ་པ། བཙུན་པ་བདག་གིས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ཚངས་པའི་གནས་བཞི་ལ་གནས་པར་བགྱིས་ན་ད་གཟོད་དེ་ནས་མཆིས་ལགས་སོ། །
en: “Lord,” replied Venerable Śāriputra, “I have just come from leading the brahmin Son of Grasping to dwell in the four immeasurables.”

source: བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཅིའི་ཕྱིར་ཁྱོད་ཀྱིས་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུ་ལ་དེའི་སྟེང་དུ་བདེན་པ་རྣམས་མ་བསྟན།
en: “Śāriputra,” the Blessed One asked further, “why did you not teach the truths to the brahmin Son of Grasping?

source: ཇི་སྟེ་བསྟན་དུ་ཟིན་ན་ཆོས་འདུལ་བ་འདི་རྟོགས་པ་ཞིག །
en: Had he understood that teaching, he would have realized the Dharma and Vinaya.

source: ཤཱ་རིའི་བུ་དེ་ལྟ་མོད་ཀྱི་ཁྱོད་སོང་བའི་འོག་ཏུ་ང་འོད་མའི་ཚལ་འདི་ནས་མི་སྣང་བར་གྱུར་ཏེ
en: Śāriputra, after you left, I disappeared from Bamboo Grove

source: བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུའི་ཁྱིམ་དུ་འདུག་ནས་ངས་དེ་ལ་དེའི་སྟེང་དུ་བདེན་པ་རྣམས་བསྟན་ཏེ།
en: and went to the house of the brahmin Son of Grasping and taught him the truths.

source: དེས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ནས་དེ་ཤི་སྟེ་དུས་ལས་འདས་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: He manifested the resultant state of non-return, and soon after, he died, transmigrated, and took birth in Brahmāloka.

source: དེ་ལྟར་ངས་འཛིན་བྱེད་ཀྱི་བུ་བདེན་པ་རྣམས་ལ་གནས་པར་བྱས་ནས་ཁྱོད་འོད་མའི་ཚལ་དུ་མ་ཕྱིན་པར་ང་ཐོག་མར་ཕྱིན་ཏོ། །
en: After leading Son of Grasping to abide in the truths, I returned to Bamboo Grove before you had arrived here.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Śāriputra replied to the Blessed One,

source: བཙུན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དེ་ལྟར་ངོ་མཚར་ཀྱི་ཆོས་དང་ལྡན་པ་ནི་ངོ་མཚར་ལགས་སོ། །
en: “Lord, it is wonderful that the blessed buddhas possess such wonderful Dharma.”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བྲམ་ཟེ་འཛིན་བྱེད་ཀྱི་བུས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ། བཅོམ་ལྡན་འདས་ཀྱང་དེས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: “Lord,” the monks asked the Blessed Buddha, “what action did the brahmin Son of Grasping take that ripened into his birth into a family of great means, prosperity, and wealth, and that he pleased the Blessed One, and did not displease him?”

source: བཙུན་པ་དེས་སྨོན་ལམ་གང་དུ་བཏབ་ལགས།
en: “Lord, where did he make these prayers?”

source: བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་གྲོང་ཁྱེར་འཐབ་མེད་ཅེས་བྱ་བ་ན་རྒྱལ་པོ་ཀླུ་ལྷ་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེདེའི་རིང་ལ་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱ་བོ་དང་མི་མང་པོས་གང་བ་དང་།
en: “Monks,” the Blessed One recounted, “in times gone by, during the reign of King Nāgadeva in the city of Ayodhyā, the kingdom was prosperous, flourishing, happy, and well populated.

source: རྩོད་པ་དང་འཐབ་པ་ཞི་བ་དང་འཁྲུག་པ་དང་ནང་འཁྲུག་དང་། ཆོམ་རྐུན་དང་། ནད་དང་མུ་གེ་མེད་པ་དང་།
en: Quarreling and arguments had ceased, there was no fighting or infighting, and there were no robbers, thieves, illness, or famine.

source: དེའི་ཚེ་གྲོང་ཁྱེར་འཐབ་མེད་ན་རྒྱལ་པོ་ཀླུ་ལྷའི་མདུན་ན་འདོན་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། ནོར་དང་གསེར་དུ་མ་དང་ལྡན་པ། ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་འདུག་པ་
en: “At that time in the city of Strifeless, King Nāgadeva had a certain magistrate, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: དེས་རྒྱལ་པོ་ལ་བརྟེན་ཅིང་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་རྣམས་ཀྱི་ནོར་ལེན་པར་བྱེད། བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་བརྟེན་ཅིང་རྒྱལ་པོའི་ནོར་ལེན་པར་བྱེད་དོ། །
en: He accepted money from the brahmins and householders on behalf of the king, and he accepted money from the king on behalf of the brahmins and householders.

source: དེ་ནས་དེའི་ཚེ་བྲམ་ཟེ་དབུལ་པོ་གཞན་ཞིག་བྲམ་ཟེ་མདུན་ན་འདོན་དེའི་ཐད་ནས་ཐག་མི་རིང་བ་ཞིག་ན་འདུག་པ་དེས། བྲམ་ཟེ་མདུན་ན་འདོན་དེས་རྒྱལ་པོ་ལ་བརྟེན་ཅིང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱི་ནོར་ལེན་པར་བྱེད་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་བརྟེན་ཅིང་རྒྱལ་པོའི་ནོར་ལེན་པར་བྱེད་དེ
en: “Now at that time there was also a certain poor brahmin who happened to be standing not too far from the brahmin magistrate just as the brahmin magistrate accepted money from brahmins and householders on behalf of the king and accepted money from the king on behalf of the brahmins and householders.

source: གཞི་དེས་ན་ཁང་བཟངས་ཀྱི་སྟེང་ན་འདུག་ཅིང་སྐྱེས་པ་མེད་པར་བུད་མེད་འབའ་ཞིག་དང་སིལ་སྙན་རྣམས་ཀྱིས་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པར་རིག་གོ། །
en: Because he did this, the magistrate was able to stay up on the roof of his palatial home in the company of only women, playing music, enjoying himself, and coupling with them.

source: དེ་ནས་བྲམ་ཟེ་དབུལ་པོ་དེས་བསམས་པ།
en: “The poor brahmin thought,

source: འདི་དཔལ་འདི་ལྟ་བུ་དག་ཉམས་སུ་མྱོང་བ་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པའི་ལས་རྣམ་པ་གསུམ་གྱི་འབྲས་བུ་ཡིན་གྱིས།
en: ‘All the glorious experiences he’s having are the result of three types of actions: giving, ethical discipline, and keeping one’s vows perfectly.
